<a href="https://colab.research.google.com/github/woodstone10/python-study/blob/main/Pandas_study.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Pandas Study

---

In [ ]:
import numpy as np
import pandas as pd
pd.__version__

'1.1.5'

## **Series** (values - automatic/specific indexing)

### array

In [ ]:
s = pd.Series([0.1, 0.23, 5, 7.5, 10]) #automatic index (0 ~) if no specfic index
s

0     0.10
1     0.23
2     5.00
3     7.50
4    10.00
dtype: float64

In [ ]:
s.values

array([ 0.1 ,  0.23,  5.  ,  7.5 , 10.  ])

### indexing

In [ ]:
s.index

RangeIndex(start=0, stop=5, step=1)

In [ ]:
s.keys() #=index

RangeIndex(start=0, stop=5, step=1)

In [ ]:
list(s.items()) #value with index

[(0, 0.1), (1, 0.23), (2, 5.0), (3, 7.5), (4, 10.0)]

In [ ]:
s[0]

0.1

### slicing

In [ ]:
s[1:4]

1    0.23
2    5.00
3    7.50
dtype: float64

In [ ]:
s[(s>0.4) & (s<8)] #conditional return

c    5.0
d    7.5
dtype: float64

### specific char index

In [ ]:
s = pd.Series([0.1, 0.23, 5, 7.5, 10],
              index=['a','b','c','d','e'])
s

a     0.10
b     0.23
c     5.00
d     7.50
e    10.00
dtype: float64

In [ ]:
s['a'] #return value with index

0.1

In [ ]:
s[['c', 'a', 'e']] #multivalue return

c     5.0
a     0.1
e    10.0
dtype: float64

In [ ]:
s['a':'c']

a    0.10
b    0.23
c    5.00
dtype: float64

In [ ]:
s[0:3]

a    0.10
b    0.23
c    5.00
dtype: float64

In [ ]:
'b' in s #check index

True

In [ ]:
s['f'] = 123
s

a      0.10
b      0.23
c      5.00
d      7.50
e     10.00
f    123.00
dtype: float64

### specific num index

In [ ]:
s = pd.Series([0.1, 0.23, 5, 5, 10],
              index=[1, 4, 5, 9, 123])
s

1       0.10
4       0.23
5       5.00
9       5.00
123    10.00
dtype: float64

In [ ]:
s.reindex(range(10))

0     NaN
1    0.10
2     NaN
3     NaN
4    0.23
5    5.00
6     NaN
7     NaN
8     NaN
9    5.00
dtype: float64

In [ ]:
s.reindex(range(10), method='bfill') #fill with back value

0    0.10
1    0.10
2    0.23
3    0.23
4    0.23
5    5.00
6    5.00
7    5.00
8    5.00
9    5.00
dtype: float64

### unique values (duplicate)

In [ ]:
s.unique() #show only unique values

array([ 0.1 ,  0.23,  5.  , 10.  ])

In [ ]:
s.value_counts() #count of unique

5.00     2
0.10     1
10.00    1
0.23     1
dtype: int64

find value

In [ ]:
s.isin([0.23])

1      False
4       True
5      False
9      False
123    False
dtype: bool

## **DataFrame** (row and column)

### dictionary

In [ ]:
df = pd.DataFrame( [ {'a':2, 'b':3, 'c':9},
                     {'a':3, 'b':23} ] ) # NaN for empty
df

   a   b    c
0  2   3  9.0
1  3  23  NaN

In [ ]:
df = pd.DataFrame(np.random.rand(5,5),
                  columns=['a','b','c','d','e'],
                  index=[1,2,3,4,5])
df

          a         b         c         d         e
1  0.727144  0.637534  0.414955  0.684236  0.670416
2  0.232461  0.181062  0.801386  0.218640  0.238799
3  0.102433  0.373885  0.951822  0.487723  0.813276
4  0.658387  0.609743  0.248783  0.437063  0.014168
5  0.483437  0.681553  0.384353  0.378825  0.562271

### Series (tuple) to DataFrame

In [ ]:
pop_tuple = {'Seoul': 9723045,
             'Pusan': 2492324,
             'Incheon': 1234123 }
population = pd.Series(pop_tuple)
population

Seoul      9723045
Pusan      2492324
Incheon    1234123
dtype: int64

In [ ]:
male_tuple = {'Seoul': 3723045,
             'Pusan': 1492324,
             'Incheon': 534123 }
male = pd.Series(male_tuple)
male

Seoul      3723045
Pusan      1492324
Incheon     534123
dtype: int64

In [ ]:
female_tuple = {'Seoul': pop_tuple['Seoul']-male_tuple['Seoul'],
             'Pusan': pop_tuple['Pusan']-male_tuple['Pusan'],
             'Incheon': pop_tuple['Incheon']-male_tuple['Incheon'] }
female = pd.Series(female_tuple)
female

Seoul      6000000
Pusan      1000000
Incheon     700000
dtype: int64

In [ ]:
df = pd.DataFrame({'population':population,
                   'male':male,
                   'female':female})
df

         population     male   female
Seoul       9723045  3723045  6000000
Pusan       2492324  1492324  1000000
Incheon     1234123   534123   700000

### indexing

In [ ]:
df.index

Index(['Seoul', 'Pusan', 'Incheon'], dtype='object')

In [ ]:
df.columns

Index(['population', 'male', 'female'], dtype='object')

In [ ]:
df.keys() #column

Index(['population', 'male', 'female'], dtype='object')

In [ ]:
list(df.items()) #value with index

[('population', Seoul      9723045
  Pusan      2492324
  Incheon    1234123
  Name: population, dtype: int64), ('male', Seoul      3723045
  Pusan      1492324
  Incheon     534123
  Name: male, dtype: int64), ('female', Seoul      6000000
  Pusan      1000000
  Incheon     700000
  Name: female, dtype: int64)]

### slicing

In [ ]:
df

         population     male   female
Seoul       9723045  3723045  6000000
Pusan       2492324  1492324  1000000
Incheon     1234123   534123   700000

In [ ]:
df.T #translate row and column

              Seoul    Pusan  Incheon
population  9723045  2492324  1234123
male        3723045  1492324   534123
female      6000000  1000000   700000

In [ ]:
df.values

array([[9723045, 3723045, 6000000],
       [2492324, 1492324, 1000000],
       [1234123,  534123,  700000]])

In [ ]:
df.values[0] #row values

array([9723045, 3723045, 6000000])

In [ ]:
df['male'] #column

Seoul      3723045
Pusan      1492324
Incheon     534123
Name: male, dtype: int64

In [ ]:
df.male #==df['male']

Seoul      3723045
Pusan      1492324
Incheon     534123
Name: male, dtype: int64

In [ ]:
df['Seoul':'Pusan'] #row slicing

       population     male   female
Seoul     9723045  3723045  6000000
Pusan     2492324  1492324  1000000

In [ ]:
df['male':'female'] #column slicing NOT work in the manner of row slicing

Empty DataFrame
Columns: [population, male, female]
Index: []

In [ ]:
df[['male':'female']] #column slicing NOT work in the manner of row slicing

SyntaxError: ignored

In [ ]:
df[['male','female']] #column slicing

            male   female
Seoul    3723045  6000000
Pusan    1492324  1000000
Incheon   534123   700000

### loc

In [ ]:
df.loc[:'Pusan',:'male'] #column slicing with string

       population     male
Seoul     9723045  3723045
Pusan     2492324  1492324

In [ ]:
df.loc[(df.male>3000000)] #condition

       population     male   female     ratio
Seoul     9723045  3723045  6000000  62.05075

In [ ]:
df.loc[(df.male>1000000) & (df.female<3000000)] #condition

       population     male   female     ratio
Pusan     2492324  1492324  1000000  149.2324

In [ ]:
df.iloc[:,1:3] #column slicing with number

            male   female
Seoul    3723045  6000000
Pusan    1492324  1000000
Incheon   534123   700000

In [ ]:
df['ratio'] = df.male / df.female * 100 #Add column
df

         population     male   female       ratio
Seoul       9723045  3723045  6000000   62.050750
Pusan       2492324  1492324  1000000  149.232400
Incheon     1234123   534123   700000   76.303286

### multi indexing

## **Index**

In [ ]:
idx1 = pd.Index([1, 2, 4, 6, 8])
idx2 = pd.Index([2, 4, 5, 6, 7])

In [ ]:
idx1.append(idx2) #

Int64Index([1, 2, 4, 6, 8, 2, 4, 5, 6, 7], dtype='int64')

In [ ]:
idx1.difference(idx2) #

Int64Index([1, 8], dtype='int64')

In [ ]:
idx1.intersection(idx2) #

Int64Index([2, 4, 6], dtype='int64')

In [ ]:
idx1&idx2

Int64Index([2, 4, 6], dtype='int64')

In [ ]:
idx1.union(idx2) # ()

Int64Index([1, 2, 4, 5, 6, 7, 8], dtype='int64')

In [ ]:
idx1 | idx2

Int64Index([1, 2, 4, 5, 6, 7, 8], dtype='int64')

In [ ]:
idx1.delete(0) #specific index delete

Int64Index([2, 4, 6, 8], dtype='int64')

In [ ]:
idx1.drop(1) #specific value delete

Int64Index([2, 4, 6, 8], dtype='int64')

In [ ]:
idx1 ^ idx2 # ( - dx1 ^ idx2 # ( - ))

Int64Index([1, 5, 7, 8], dtype='int64')

## Calcualtion

### +add

In [ ]:
s1 = pd.Series([1, 3, 5, 7, 9], index=[0,1,2,3,4])
s2 = pd.Series([2, 4, 6, 8, 10], index=[1,2,3,4,5])
s1+s2

0     NaN
1     5.0
2     9.0
3    13.0
4    17.0
5     NaN
dtype: float64

In [ ]:
s1.add(s2, fill_value=0) #s1+s2 fill 0 for empty

0     1.0
1     5.0
2     9.0
3    13.0
4    17.0
5    10.0
dtype: float64

In [ ]:
df1 = pd.DataFrame(np.random.randint(0,20,(3,3)), columns=list('ACD'))
df2 = pd.DataFrame(np.random.randint(0,20,(5,5)), columns=list('ABCDE'))
df1+df2

      A   B     C     D   E
0  33.0 NaN  18.0  36.0 NaN
1  26.0 NaN  26.0  30.0 NaN
2  30.0 NaN  14.0  11.0 NaN
3   NaN NaN   NaN   NaN NaN
4   NaN NaN   NaN   NaN NaN

In [ ]:
df1.add(df2, fill_value=0) #df1+df2 fill 0 for empty

      A     B     C     D     E
0  33.0   4.0  18.0  36.0   2.0
1  26.0  11.0  26.0  30.0  17.0
2  30.0  14.0  14.0  11.0   3.0
3   6.0  12.0   9.0  18.0  15.0
4  13.0  17.0   9.0   7.0   9.0

In [ ]:
df1

    A   C   D
0  17  14  18
1   8  10  19
2  16  13   0

In [ ]:
df1.loc[0]

A    17
C    14
D    18
Name: 0, dtype: int64

In [ ]:
df1 + df1.iloc[0] #broadcasting

    A   C   D
0  34  28  36
1  25  24  37
2  33  27  18

### -sub

In [ ]:
df1

    A   C   D
0  17  14  18
1   8  10  19
2  16  13   0

In [ ]:
df1 - df1.iloc[0]

   A  C   D
0  0  0   0
1 -9 -4   1
2 -1 -1 -18

In [ ]:
df1.sub(df1.iloc[0])

   A  C   D
0  0  0   0
1 -9 -4   1
2 -1 -1 -18

In [ ]:
df1.sub(df1['A'], axis=0)

   A  C   D
0  0 -3   1
1  0  2  11
2  0 -3 -16

### *mul

In [ ]:
df1 * df1.iloc[0]

     A    C    D
0  289  196  324
1  136  140  342
2  272  182    0

In [ ]:
df1.mul(df1.iloc[0])

     A    C    D
0  289  196  324
1  136  140  342
2  272  182    0

### /div

In [ ]:
df1 / df1.iloc[0]

          A         C         D
0  1.000000  1.000000  1.000000
1  0.470588  0.714286  1.055556
2  0.941176  0.928571  0.000000

In [ ]:
df1.div(df1.iloc[0])

          A         C         D
0  1.000000  1.000000  1.000000
1  0.470588  0.714286  1.055556
2  0.941176  0.928571  0.000000

### //floordiv

In [ ]:
df1 // df1.iloc[0]

   A  C  D
0  1  1  1
1  0  0  1
2  0  0  0

In [ ]:
df1.floordiv(df1.iloc[0])

   A  C  D
0  1  1  1
1  0  0  1
2  0  0  0

### %mod

In [ ]:
df1 % df1.iloc[0]

    A   C  D
0   0   0  0
1   8  10  1
2  16  13  0

In [ ]:
df1.mod(df1.iloc[0])

    A   C  D
0   0   0  0
1   8  10  1
2  16  13  0

### **pow

In [ ]:
df1 ** df1.iloc[0]

                     A                  C                    D
0 -2863221430593058543  11112006825558016  -497033925936021504
1     2251799813685248    100000000000000 -4519998179177339479
2                    0   3937376385699289                    0

In [ ]:
df1.pow(df1.iloc[0])

                     A                  C                    D
0 -2863221430593058543  11112006825558016  -497033925936021504
1     2251799813685248    100000000000000 -4519998179177339479
2                    0   3937376385699289                    0

## sort

In [ ]:
s = pd.Series(np.random.randint(-5,5,5), index=['a','d','e','c','b'])
s

a    0
d    4
e   -2
c   -3
b    4
dtype: int64

In [ ]:
s.sort_index()

a    0
b    4
c   -3
d    4
e   -2
dtype: int64

In [ ]:
s.sort_values()

c   -3
e   -2
a    0
d    4
b    4
dtype: int64

## rank

In [ ]:
s.rank()

a    3.0
d    4.5
e    2.0
c    1.0
b    4.5
dtype: float64

In [ ]:
s.rank(method='first')

a    3.0
d    4.0
e    2.0
c    1.0
b    5.0
dtype: float64

## eval

In [ ]:
nrows, ncols = 100000, 100
df1, df2, df3, df4 = (pd.DataFrame(np.random.rand(nrows,ncols)) for i in range(4))
%timeit df1*df2/df3%df4

1 loop, best of 5: 341 ms per loop

In [ ]:
%timeit pd.eval('df1*df2/df3%df4')

10 loops, best of 5: 73.4 ms per loop

In [ ]:
df = pd.DataFrame(np.random.rand(100000,5), columns=['a','b','c','d','e'])
df.head()

          a         b         c         d         e
0  0.753679  0.225045  0.597422  0.702659  0.543709
1  0.111140  0.216079  0.172066  0.176406  0.927580
2  0.376572  0.660514  0.412117  0.664605  0.735161
3  0.215267  0.111391  0.018741  0.488430  0.953620
4  0.220368  0.114958  0.969650  0.864050  0.372145

In [ ]:
pd.eval('df.a + df.b / df.c * df.d - df.e')

0         0.474657
1        -0.594911
2         0.706598
3         2.164738
4        -0.049338
           ...
99995    -0.115264
99996     0.668740
99997    -0.486830
99998    66.739015
99999    -0.109079
Length: 100000, dtype: float64

In [ ]:
df.eval('a + b / c * d - e')

0         0.474657
1        -0.594911
2         0.706598
3         2.164738
4        -0.049338
           ...
99995    -0.115264
99996     0.668740
99997    -0.486830
99998    66.739015
99999    -0.109079
Length: 100000, dtype: float64

In [ ]:
df.eval('f = a + b / c * d - e', inplace=True)
df.head()

          a         b         c         d         e         f
0  0.753679  0.225045  0.597422  0.702659  0.543709  0.474657
1  0.111140  0.216079  0.172066  0.176406  0.927580 -0.594911
2  0.376572  0.660514  0.412117  0.664605  0.735161  0.706598
3  0.215267  0.111391  0.018741  0.488430  0.953620  2.164738
4  0.220368  0.114958  0.969650  0.864050  0.372145 -0.049338

In [ ]:
col_mean = df.mean(1)
col_mean

0         0.549529
1         0.168060
2         0.592595
3         0.658698
4         0.415305
           ...
99995     0.477145
99996     0.625507
99997     0.340264
99998    11.568770
99999     0.302101
Length: 100000, dtype: float64

In [ ]:
df['a']+col_mean

0         1.303208
1         0.279200
2         0.969167
3         0.873965
4         0.635673
           ...
99995     0.715121
99996     1.261645
99997     0.710150
99998    12.454803
99999     0.620968
Length: 100000, dtype: float64

In [ ]:
df.eval('a + @col_mean')

0         1.303208
1         0.279200
2         0.969167
3         0.873965
4         0.635673
           ...
99995     0.715121
99996     1.261645
99997     0.710150
99998    12.454803
99999     0.620968
Length: 100000, dtype: float64

In [ ]:
df[(df.a<10) & (df.c>0.5)]

              a         b         c         d         e         f
0      0.753679  0.225045  0.597422  0.702659  0.543709  0.474657
4      0.220368  0.114958  0.969650  0.864050  0.372145 -0.049338
9      0.612882  0.758903  0.994047  0.311092  0.294384  0.556000
16     0.707097  0.460071  0.823997  0.790342  0.628497  0.519880
17     0.617001  0.177119  0.775854  0.394631  0.813126 -0.106034
...         ...       ...       ...       ...       ...       ...
99994  0.961886  0.427205  0.854279  0.310203  0.292493  0.824519
99995  0.237976  0.369170  0.565687  0.878651  0.926652 -0.115264
99996  0.636138  0.434955  0.590308  0.838024  0.584877  0.668740
99997  0.369885  0.344988  0.917862  0.028321  0.867360 -0.486830
99999  0.318867  0.103418  0.962395  0.098476  0.438528 -0.109079

[50180 rows x 6 columns]

In [ ]:
pd.eval('df[(df.a<10) & (df.c>0.5)]')

              a         b         c         d         e         f
0      0.753679  0.225045  0.597422  0.702659  0.543709  0.474657
4      0.220368  0.114958  0.969650  0.864050  0.372145 -0.049338
9      0.612882  0.758903  0.994047  0.311092  0.294384  0.556000
16     0.707097  0.460071  0.823997  0.790342  0.628497  0.519880
17     0.617001  0.177119  0.775854  0.394631  0.813126 -0.106034
...         ...       ...       ...       ...       ...       ...
99994  0.961886  0.427205  0.854279  0.310203  0.292493  0.824519
99995  0.237976  0.369170  0.565687  0.878651  0.926652 -0.115264
99996  0.636138  0.434955  0.590308  0.838024  0.584877  0.668740
99997  0.369885  0.344988  0.917862  0.028321  0.867360 -0.486830
99999  0.318867  0.103418  0.962395  0.098476  0.438528 -0.109079

[50180 rows x 6 columns]

In [ ]:
df.query('(a<10) & (c>0.5)')

              a         b         c         d         e         f
0      0.753679  0.225045  0.597422  0.702659  0.543709  0.474657
4      0.220368  0.114958  0.969650  0.864050  0.372145 -0.049338
9      0.612882  0.758903  0.994047  0.311092  0.294384  0.556000
16     0.707097  0.460071  0.823997  0.790342  0.628497  0.519880
17     0.617001  0.177119  0.775854  0.394631  0.813126 -0.106034
...         ...       ...       ...       ...       ...       ...
99994  0.961886  0.427205  0.854279  0.310203  0.292493  0.824519
99995  0.237976  0.369170  0.565687  0.878651  0.926652 -0.115264
99996  0.636138  0.434955  0.590308  0.838024  0.584877  0.668740
99997  0.369885  0.344988  0.917862  0.028321  0.867360 -0.486830
99999  0.318867  0.103418  0.962395  0.098476  0.438528 -0.109079

[50180 rows x 6 columns]

## concat() / append()

In [ ]:
s1 = pd.Series(['a', 'b'], index=[1, 2])
s2 = pd.Series(['c', 'd'], index=[3, 4])
pd.concat([s1, s2])

1    a
2    b
3    c
4    d
dtype: object

In [ ]:
def create_df(cols, idx):
  data = {c: [str(c.lower()) + str(i) for i in idx] for c in cols}
  return pd.DataFrame(data, idx)

In [ ]:
df1 = create_df('AB', [1,2])
df1

    A   B
1  a1  b1
2  a2  b2

In [ ]:
df2 = create_df('AB', [3,4])
df2

    A   B
3  a3  b3
4  a4  b4

In [ ]:
pd.concat([df1, df2]) #row(index)

    A   B
1  a1  b1
2  a2  b2
3  a3  b3
4  a4  b4

In [ ]:
df3 = create_df('AB', [0,1])
df3

    A   B
0  a0  b0
1  a1  b1

In [ ]:
df4 = create_df('CD', [0,1])
df4

    C   D
0  c0  d0
1  c1  d1

In [ ]:
pd.concat([df3, df4])

     A    B    C    D
0   a0   b0  NaN  NaN
1   a1   b1  NaN  NaN
0  NaN  NaN   c0   d0
1  NaN  NaN   c1   d1

In [ ]:
pd.concat([df3, df4], axis=1) #colume

    A   B   C   D
0  a0  b0  c0  d0
1  a1  b1  c1  d1

In [ ]:
df3.append(df4)

     A    B    C    D
0   a0   b0  NaN  NaN
1   a1   b1  NaN  NaN
0  NaN  NaN   c0   d0
1  NaN  NaN   c1   d1

In [ ]:
pd.concat([df1, df3], keys=['X','Y'])

      A   B
X 1  a1  b1
  2  a2  b2
Y 0  a0  b0
  1  a1  b1

## merge()

In [ ]:
df1 = pd.DataFrame( {'student': ['john', 'mark', 'david'],
                     'major': ['economic', 'education', 'engineering']
                     } )
df1

  student        major
0    john     economic
1    mark    education
2   david  engineering

In [ ]:
df2 = pd.DataFrame( {'student': ['john', 'mark', 'david'],
                     'year': ['2018', '2019', '2020']
                     } )
df2

  student  year
0    john  2018
1    mark  2019
2   david  2020

In [ ]:
df3 = pd.merge(df1, df2)
df3

  student        major  year
0    john     economic  2018
1    mark    education  2019
2   david  engineering  2020

In [ ]:
df4 = pd.DataFrame( { 'major': ['economic', 'education', 'engineering'],
                     'lead': ['kim', 'lee', 'nam'],
                     } )
df4

         major lead
0     economic  kim
1    education  lee
2  engineering  nam

In [ ]:
pd.merge(df3, df4)

  student        major  year lead
0    john     economic  2018  kim
1    mark    education  2019  lee
2   david  engineering  2020  nam

In [ ]:
df4 = pd.DataFrame( { 'major': ['economic', 'education', 'engineering', 'engineering', 'engineering' ],
                     'lecture': ['stock', 'teaching', 'machine learning', 'programming', 'wireless']
                     } )
df4

         major           lecture
0     economic             stock
1    education          teaching
2  engineering  machine learning
3  engineering       programming
4  engineering          wireless

In [ ]:
pd.merge(df3, df4)

  student        major  year           lecture
0    john     economic  2018             stock
1    mark    education  2019          teaching
2   david  engineering  2020  machine learning
3   david  engineering  2020       programming
4   david  engineering  2020          wireless

## Statis aggregation

```
# This is formatted as code
```

tic

In [ ]:
df = pd.DataFrame([ [1, 1.2, np.nan],
                   [2.4, 5.5, 4.2],
                   [np.nan, np.nan, np.nan],
                   [0.44, -3.1, -4.1]],
                   columns=['a','b','c'])
df

      a    b    c
0  1.00  1.2  NaN
1  2.40  5.5  4.2
2   NaN  NaN  NaN
3  0.44 -3.1 -4.1

In [ ]:
df.head(2)

     a    b    c
0  1.0  1.2  NaN
1  2.4  5.5  4.2

In [ ]:
df.tail(2)

      a    b    c
2   NaN  NaN  NaN
3  0.44 -3.1 -4.1

In [ ]:
df.describe()

              a     b         c
count  3.000000  3.00  2.000000
mean   1.280000  1.20  0.050000
std    1.009554  4.30  5.868986
min    0.440000 -3.10 -4.100000
25%    0.720000 -0.95 -2.025000
50%    1.000000  1.20  0.050000
75%    1.700000  3.35  2.125000
max    2.400000  5.50  4.200000

In [ ]:
df.idxmin()

a    3
b    3
c    3
dtype: int64

In [ ]:
df.idxmax()

a    1
b    1
c    1
dtype: int64

In [ ]:
df.std()

In [ ]:
df.var()

In [ ]:
df.sum()

a    3.84
b    3.60
c    0.10
dtype: float64

In [ ]:
df.cumsum()

      a    b    c
0  1.00  1.2  NaN
1  3.40  6.7  4.2
2   NaN  NaN  NaN
3  3.84  3.6  0.1

In [ ]:
df.prod()

a     1.056
b   -20.460
c   -17.220
dtype: float64

In [ ]:
df.cumprod()

       a      b      c
0  1.000   1.20    NaN
1  2.400   6.60   4.20
2    NaN    NaN    NaN
3  1.056 -20.46 -17.22

In [ ]:
df.diff()

     a    b   c
0  NaN  NaN NaN
1  1.4  4.3 NaN
2  NaN  NaN NaN
3  NaN  NaN NaN

In [ ]:
df.quantile()

a    1.00
b    1.20
c    0.05
Name: 0.5, dtype: float64

In [ ]:
df.pct_change()

          a         b        c
0       NaN       NaN      NaN
1  1.400000  3.583333      NaN
2  0.000000  0.000000  0.00000
3 -0.816667 -1.563636 -1.97619

In [ ]:
df.corr()

          a         b    c
a  1.000000  0.970725  1.0
b  0.970725  1.000000  1.0
c  1.000000  1.000000  1.0

In [ ]:
df.cov() #

        a       b       c
a  1.0192   4.214   8.134
b  4.2140  18.490  35.690
c  8.1340  35.690  34.445

## groupby

In [ ]:
df =pd.DataFrame( {'c1':['a','a','b','b','c','b','b'],
                   'c2':['A','B','C','C','D','D','B'],
                   'c3':np.random.randint(7),
                   'c4':np.random.random(7) })
df

  c1 c2  c3        c4
0  a  A   1  0.648272
1  a  B   1  0.429232
2  b  C   1  0.403112
3  b  C   1  0.829495
4  c  D   1  0.853051
5  b  D   1  0.145859
6  b  B   1  0.001346

In [ ]:
df.dtypes

c1     object
c2     object
c3      int64
c4    float64
dtype: object

In [ ]:
df['c3'].groupby(df['c1']).mean() #c3 c1

c1
a    1
b    1
c    1
Name: c3, dtype: int64

In [ ]:
df['c3'].groupby(df['c1']).std()

c1
a    0.0
b    0.0
c    NaN
Name: c3, dtype: float64

In [ ]:
df['c3'].groupby([df['c1'], df['c2']]).mean()

c1  c2
a   A     1
    B     1
b   B     1
    C     1
    D     1
c   D     1
Name: c3, dtype: int64

In [ ]:
df['c4'].groupby([df['c1'], df['c2']]).mean().unstack()

c2         A         B         C         D
c1
a   0.648272  0.429232       NaN       NaN
b        NaN  0.001346  0.616303  0.145859
c        NaN       NaN       NaN  0.853051

In [ ]:
df.groupby(['c1', 'c2']).mean()

       c3        c4
c1 c2
a  A    1  0.648272
   B    1  0.429232
b  B    1  0.001346
   C    1  0.616303
   D    1  0.145859
c  D    1  0.853051

In [ ]:
df.groupby(['c1', 'c2'])[['c4']].mean()

             c4
c1 c2
a  A   0.648272
   B   0.429232
b  B   0.001346
   C   0.616303
   D   0.145859
c  D   0.853051

In [ ]:
df.groupby(['c1', 'c2'])[['c4']].agg(['mean','min','max','count','size'])

             c4
           mean       min       max count size
c1 c2
a  A   0.648272  0.648272  0.648272     1    1
   B   0.429232  0.429232  0.429232     1    1
b  B   0.001346  0.001346  0.001346     1    1
   C   0.616303  0.403112  0.829495     2    2
   D   0.145859  0.145859  0.145859     1    1
c  D   0.853051  0.853051  0.853051     1    1

In [ ]:
df

  c1 c2  c3        c4
0  a  A   1  0.648272
1  a  B   1  0.429232
2  b  C   1  0.403112
3  b  C   1  0.829495
4  c  D   1  0.853051
5  b  D   1  0.145859
6  b  B   1  0.001346

In [ ]:
df.sort_values(by='c1')[-3:]

  c1 c2  c3        c4
5  b  D   1  0.145859
6  b  B   1  0.001346
4  c  D   1  0.853051

## Pivot Table

In [ ]:
df =pd.DataFrame( {'c1':['a','a','b','b','c','b','b'],
                   'c2':['A','B','C','C','D','D','B'],
                   'c3':np.random.randint(7),
                   'c4':np.random.random(7) })
df

  c1 c2  c3        c4
0  a  A   6  0.712376
1  a  B   6  0.949401
2  b  C   6  0.701986
3  b  C   6  0.607548
4  c  D   6  0.027275
5  b  D   6  0.298067
6  b  B   6  0.258591

In [ ]:
df.pivot_table( ['c3', 'c4'],
               index=['c1'],
               columns=['c2'])

     c3                       c4
c2    A    B    C    D         A         B         C         D
c1
a   6.0  6.0  NaN  NaN  0.712376  0.949401       NaN       NaN
b   NaN  6.0  6.0  6.0       NaN  0.258591  0.654767  0.298067
c   NaN  NaN  NaN  6.0       NaN       NaN       NaN  0.027275

In [ ]:
df.pivot_table( ['c3', 'c4'],
               index=['c1'],
               columns=['c2'],
               margins=True)

      c3                           c4
c2     A    B    C    D All         A         B         C         D       All
c1
a    6.0  6.0  NaN  NaN   6  0.712376  0.949401       NaN       NaN  0.830889
b    NaN  6.0  6.0  6.0   6       NaN  0.258591  0.654767  0.298067  0.466548
c    NaN  NaN  NaN  6.0   6       NaN       NaN       NaN  0.027275  0.027275
All  6.0  6.0  6.0  6.0   6  0.712376  0.603996  0.654767  0.162671  0.507892

In [ ]:
df.pivot_table( ['c3', 'c4'],
               index=['c1'],
               columns=['c2'],
               margins=True,
               aggfunc=sum)

      c3                    ...        c4
c2     A     B     C     D  ...         B         C         D       All
c1                          ...
a    6.0   6.0   NaN   NaN  ...  0.949401       NaN       NaN  1.661777
b    NaN   6.0  12.0   6.0  ...  0.258591  1.309534  0.298067  1.866191
c    NaN   NaN   NaN   6.0  ...       NaN       NaN  0.027275  0.027275
All  6.0  12.0  12.0  12.0  ...  1.207993  1.309534  0.325342  3.555244

[4 rows x 10 columns]

In [ ]:
df.pivot_table( ['c3', 'c4'],
               index=['c1'],
               columns=['c2'],
               margins=True,
               aggfunc=sum,
               fill_value=0)

    c3                        c4
c2   A   B   C   D All         A         B         C         D       All
c1
a    6   6   0   0  12  0.712376  0.949401  0.000000  0.000000  1.661777
b    0   6  12   6  24  0.000000  0.258591  1.309534  0.298067  1.866191
c    0   0   0   6   6  0.000000  0.000000  0.000000  0.027275  0.027275
All  6  12  12  12  42  0.712376  1.207993  1.309534  0.325342  3.555244

In [ ]:
pd.crosstab(df.c1, df.c2)

c2  A  B  C  D
c1
a   1  1  0  0
b   0  1  2  1
c   0  0  0  1

## Categorical

In [ ]:
s = pd.Series( ['c1','c2','c1','c1','c2'] *2 )
s

0    c1
1    c2
2    c1
3    c1
4    c2
5    c1
6    c2
7    c1
8    c1
9    c2
dtype: object

In [ ]:
pd.unique(s)

array(['c1', 'c2'], dtype=object)

In [ ]:
pd.value_counts(s)

c1    6
c2    4
dtype: int64

In [ ]:
code = pd.Series( [0, 1, 0, 1, 0] *2 )
code

0    0
1    1
2    0
3    1
4    0
5    0
6    1
7    0
8    1
9    0
dtype: int64

In [ ]:
d = pd.Series(['c1','c2'])
d

0    c1
1    c2
dtype: object

In [ ]:
d.take(code)

0    c1
1    c2
0    c1
1    c2
0    c1
0    c1
1    c2
0    c1
1    c2
0    c1
dtype: object

In [ ]:
s

0    c1
1    c2
2    c1
3    c1
4    c2
5    c1
6    c2
7    c1
8    c1
9    c2
dtype: object

In [ ]:
df = pd.DataFrame( {'id':np.arange(len(s)), 
                  'c':s,
                  'v':np.random.randint(1000,3000,len(s)) })
df

   id   c     v
0   0  c1  1562
1   1  c2  1950
2   2  c1  2675
3   3  c1  1047
4   4  c2  1149
5   5  c1  2073
6   6  c2  2911
7   7  c1  1614
8   8  c1  1479
9   9  c2  2314

In [ ]:
c = df['c'].astype('category')
c

0    c1
1    c2
2    c1
3    c1
4    c2
5    c1
6    c2
7    c1
8    c1
9    c2
Name: c, dtype: category
Categories (2, object): ['c1', 'c2']

In [ ]:
c.values

['c1', 'c2', 'c1', 'c1', 'c2', 'c1', 'c2', 'c1', 'c1', 'c2']
Categories (2, object): ['c1', 'c2']

In [ ]:
c.values.categories

Index(['c1', 'c2'], dtype='object')

In [ ]:
c.values.codes

array([0, 1, 0, 0, 1, 0, 1, 0, 0, 1], dtype=int8)

## str

In [ ]:
name = ['Jonggil Nam', 'Soo Kim', 'David', None, 'Mary']
name

['Jonggil Nam', 'Soo Kim', 'David', None, 'Mary']

In [ ]:
names = pd.Series(name)
names

0    Jonggil Nam
1        Soo Kim
2          David
3           None
4           Mary
dtype: object

In [ ]:
names.str.lower()

0    jonggil nam
1        soo kim
2          david
3           None
4           mary
dtype: object

In [ ]:
names.str.len()

0    11.0
1     7.0
2     5.0
3     NaN
4     4.0
dtype: float64

In [ ]:
names.str.split()

0    [Jonggil, Nam]
1        [Soo, Kim]
2           [David]
3              None
4            [Mary]
dtype: object

In [ ]:
names.str[0:4]

0    Jong
1    Soo
2    Davi
3    None
4    Mary
dtype: object

## Regular expression

In [ ]:
names.str.match('([A-Za-z]+)')

0    True
1    True
2    True
3    None
4    True
dtype: object

In [ ]:
names.str.findall('([A-Za-z]+)')

0    [Jonggil, Nam]
1        [Soo, Kim]
2           [David]
3              None
4            [Mary]
dtype: object

## Time series

In [ ]:
idx = pd.DatetimeIndex( ['2019-01-01', '2020-03-18', '2020-03-19'] )
s = pd.Series(np.arange(len(idx)),index=idx)
s

2019-01-01    0
2020-03-18    1
2020-03-19    2
dtype: int64

In [ ]:
s['2020-01-01':] #2020

2020-03-18    1
2020-03-19    2
dtype: int64

In [ ]:
s['2019'] #2019

2019-01-01    0
dtype: int64

In [ ]:
from datetime import datetime
dates = pd.to_datetime(['01-01-2018', datetime(2020,1,1), '2nd of Feb, 2016', '2020-Mar-4', '20200301'])
dates

DatetimeIndex(['2018-01-01', '2020-01-01', '2016-02-02', '2020-03-04',
               '2020-03-01'],
              dtype='datetime64[ns]', freq=None)

In [ ]:
dates.to_period('D')

PeriodIndex(['2018-01-01', '2020-01-01', '2016-02-02', '2020-03-04',
             '2020-03-01'],
            dtype='period[D]', freq='D')

In [ ]:
dates - dates[0] #

TimedeltaIndex(['0 days', '730 days', '-699 days', '793 days', '790 days'], dtype='timedelta64[ns]', freq=None)

In [ ]:
pd.date_range('2020-01-03', '2020-12-12')

DatetimeIndex(['2020-01-03', '2020-01-04', '2020-01-05', '2020-01-06',
               '2020-01-07', '2020-01-08', '2020-01-09', '2020-01-10',
               '2020-01-11', '2020-01-12',
               ...
               '2020-12-03', '2020-12-04', '2020-12-05', '2020-12-06',
               '2020-12-07', '2020-12-08', '2020-12-09', '2020-12-10',
               '2020-12-11', '2020-12-12'],
              dtype='datetime64[ns]', length=345, freq='D')

In [ ]:
pd.date_range('2021-04-10', periods=7)

DatetimeIndex(['2021-04-10', '2021-04-11', '2021-04-12', '2021-04-13',
               '2021-04-14', '2021-04-15', '2021-04-16'],
              dtype='datetime64[ns]', freq='D')

In [ ]:
pd.date_range('2021-04-10', periods=7, freq='M')

DatetimeIndex(['2021-04-30', '2021-05-31', '2021-06-30', '2021-07-31',
               '2021-08-31', '2021-09-30', '2021-10-31'],
              dtype='datetime64[ns]', freq='M')

In [ ]:
pd.date_range('2021-04-10', periods=7, freq='H')

DatetimeIndex(['2021-04-10 00:00:00', '2021-04-10 01:00:00',
               '2021-04-10 02:00:00', '2021-04-10 03:00:00',
               '2021-04-10 04:00:00', '2021-04-10 05:00:00',
               '2021-04-10 06:00:00'],
              dtype='datetime64[ns]', freq='H')

In [ ]:
dates = pd.to_datetime(['01-01-2018 12:00:00', datetime(2020,1,1), '2nd of Feb, 2016', '2020-Mar-4', '20200301'])
dates

DatetimeIndex(['2018-01-01 12:00:00', '2020-01-01 00:00:00',
               '2016-02-02 00:00:00', '2020-03-04 00:00:00',
               '2020-03-01 00:00:00'],
              dtype='datetime64[ns]', freq=None)